In [5]:
import pandas as pd

# Viewing Basic Properties of a DataFrame

## 1. Setup a Sample DataFrame

In [2]:
df = pd.DataFrame({
    "Name": ["Aaa", "Bbb", "Ccc", "Ddd"],
    "Age": [21, 25, 27, 30],
    "City": ["Mumbai", "Pune", "Nashik", "Satara"]
})

df

  Name  Age    City
0  Aaa   21  Mumbai
1  Bbb   25    Pune
2  Ccc   27  Nashik
3  Ddd   30  Satara

## 2. `.shape` -> Rows & Columns

In [3]:
df.shape

(4, 3)

(rows, columns)  
(4, 3)   
4 - Rows  
3 - Columns

## 3. `.dtypes` -> Data type of each columns
  
object - String  
int64 - integer  
float64 - floating point number

In [4]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

## 4. `.index` -> Row labels

In [5]:
df.index

RangeIndex(start=0, stop=4, step=1)

its same line python for loop range() function  
range(4) -> 0, 1, 2, 3.

## 5. `.columns` -> Column names

In [6]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

## 5. `.info()`
It showns information of DF.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

## 5. `.describe()`
It shows count, mean, std, min, etc

In [8]:
df.describe()

             Age
count   4.000000
mean   25.750000
std     3.774917
min    21.000000
25%    24.000000
50%    26.000000
75%    27.750000
max    30.000000

# Practice Time  
1. Create a DataFrame with columns: Name, Marks, Grade. Add 4 rows.  
2. Print:
   - df.shape
   - df.columns
   - df.index
   - df.dtypes
3. What is the datatype of your Grade column?
4. Use df.info() and observe non-null counts.

In [3]:
Stud_data = {
    "Name": ["Aaa", "Bbb", "Ccc", "Ddd"],
    "Marks": [21, 32, 12, 27],
    "Grade": ["A","B","C","D"]

}

In [6]:
stud_df = pd.DataFrame(Stud_data)

In [9]:
print(stud_df.shape)

(4, 3)

In [10]:
print(stud_df.columns)

Index(['Name', 'Marks', 'Grade'], dtype='object')

In [11]:
print(stud_df.index)

RangeIndex(start=0, stop=4, step=1)

In [12]:
print(stud_df.dtypes)

Name     object
Marks     int64
Grade    object
dtype: object

3. grade column data type is object i.e. it is string

In [14]:
# 4
print(stud_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Marks   4 non-null      int64
 2   Grade   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes
None

We filled the whole data so there is not a single null value so there are all 4 nob-null values in every column.